cases/LFDC/Nguyen/0.org/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1E5;

boundaryField
{
    inlet
    {
        type        fixedFluxPressure;
        value       $internalField;
    }

    outlet
    {
        type        totalPressure;
        p0          $internalField;
    }

    walls
    {
        type        fixedFluxPressure;
        value       $internalField;
    }

    front
    {
        type        wedge;
    }

    back
    {
        type        wedge;
    }

    axis
    {
        type        empty;
    }
}
