cases/LFDC/Nguyen/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

regions
(
    boxToCell
    {
        box (0 -1 0) (0.1 1 1);

        fieldValues
        (
            volScalarFieldValue T 375.15
        );
    }

    boxToFace
    {
        box (0 -1 0.00499) (0.1 1 1);

        fieldValues
        (
            volScalarFieldValue T 375.15
        );
    }

    boxToCell
    {
        box (0.1 -1 0) (1 1 1);

        fieldValues
        (
            volScalarFieldValue T 294.55
        );
    }

    boxToFace
    {
        box (0.1 -1 0.00499) (1 1 1);

        fieldValues
        (
            volScalarFieldValue T 294.55
        );
    }
);
